//=====================================================================
//文件名称：modelPreprocess.h
//功能概要：模型驱动构件源文件
//制作单位：苏州大学嵌入式系统与物联网研究所(sumcu.suda.edu.cn)
//版    本：  2020-07-19  V1.0
//适用芯片：STM32
//=====================================================================
#ifndef MODELPREPROCESS_H_
#define MODELPREPROCESS_H_

#include "includes.h"
#include "modelPredict.h"
//=====================================================================
//函数名称：rgb565togray_256
//函数返回：gray：转换后的灰阶
//参数说明：color：转换前的16位RGB565格式像素点
//功能概要：将RGB565格式转换为lcd可以显示的256阶的灰度格式。
//=====================================================================
uint8_t rgb565togray_256 (uint16_t color);

//=====================================================================
//函数名称:Model_GetInputImg_Gray
//函数返回:处理成功返回1
//参数说明:	 image:56*56大小的16位彩色图像
//		   output:推理模型的输入8位灰度图像
//功能概要:灰度图像下采样
//=====================================================================
int Model_GetInputImg_Gray(uint16_t* image,image_32 output);

//=====================================================================
//函数名称:Model_GetInputImg_Color
//函数返回:输出激活值数组指针
//参数说明:image:56*56大小的16位RGB一维图像数组
//		   output:推理模型的输入三维彩色数组图像
//功能概要:彩色图像下采样
//=====================================================================
int Model_GetInputImg_Color(uint16_t* image,image_3_32 output);

#endif /* MODELPREPROCESS_H_ */
