///=====================================================================
//文件名称：Temp_.c文件
//制作单位：SD-Arm(sumcu.suda.edu.cn)
//更新记录：20220321
//移植规则：【固定】
///=====================================================================
#include "Temp_Convert.h"

//============================================================================
//函数名称：TempTrans
//功能概要：将读到的mcu温度AD值转换为实际温度
//参数说明：mcu_temp_AD：通过adc_read函数得到的AD值
//函数返回：实际温度值
//============================================================================
float TempTrans(uint16_t mcu_temp_AD)
{
	float mcu_temp_result;
	//mcu_temp_result=0.2*(((float)(mcu_temp_AD) - 1000-(float)(1.43))/4.3+25);
	mcu_temp_result=(float)(15+(3*(2050-(float)(mcu_temp_AD) ))/4.3);
	return mcu_temp_result;
 
}

//============================================================================
//函数名称：TempRegression
//功能概要：将读到的外部热敏电阻AD值转换为实际温度
//参数说明：tmpAD：通过adc_read函数得到的AD值
//函数返回：实际温度值
//============================================================================
float TempRegression(uint16_t tmpAD)
{
    float Vtemp,Rtemp,temp;
    if(tmpAD<=72)
    {
       return -274;
    }
    Vtemp = (tmpAD*3300.0)/4096;
    Rtemp = Vtemp/(3300.0 - Vtemp)*10000.0;
    temp = (1/(log(Rtemp/10000.0)/3950.0 + (1/(273.15 + 25)))) - 275.15 + 25; 
    return temp; 
}
