//=====================================================================
//文件名称：ov7670.h
//功能概要：ov7670摄像头底层驱动构件头文件
//版    本：2020-08-09 
//使用芯片：STM32L433xx
//=====================================================================
#ifndef _CAMERA_H_
#define _CAMERA_H_

#include "sccb.h"
#include "includes.h"
#include "gpio.h"
#include "spi.h"
#include "gec.h"
#include "lcd.h"

#define cam_OV7670_ADRESS   0X42

#define cam_VSYNC       (PTC_NUM|12)        // 帧传送结束
#define cam_FIFO_OE     (PTA_NUM|8)     //输出使能
#define cam_FIFO_RCK    (PTA_NUM|15)    //像素时钟
#define cam_FIFO_WRST   (PTC_NUM|9) //写信号复位
#define cam_FIFO_RRST   (PTC_NUM|8)     //读信号复位
#define cam_FIFO_WR     (PTB_NUM|8)

//定义FIFO数据接收的8个IO口
#define cam_DATA_IO_0   (PTD_NUM|0)  
#define cam_DATA_IO_1   (PTD_NUM|1)
#define cam_DATA_IO_2   (PTD_NUM|2)
#define cam_DATA_IO_3   (PTD_NUM|3)
#define cam_DATA_IO_4   (PTD_NUM|4)
#define cam_DATA_IO_5   (PTD_NUM|5)
#define cam_DATA_IO_6   (PTD_NUM|6)
#define cam_DATA_IO_7   (PTD_NUM|7)


//=====================================================================
//函数名称：cam_init
//函数返回：0：配置成功
//          1：失败
//          2：读取到数据但是不正确，重新初始化一次
//参数说明：无
//功能概要：摄像头初始化相关配置
//=====================================================================
uint8_t cam_init();

//=====================================================================
//函数名称：cam_getimg3d
//函数返回：图像数组指针
//参数说明：无
//功能概要：获得56*56大小的16位RGB图像
//=====================================================================
uint16_t* cam_getimg_5656();

//=====================================================================
//函数名称：cam_open
//函数返回：无
//参数说明：无
//功能概要：打开摄像头
//=====================================================================
void cam_open();

//=====================================================================
//函数名称：cam_close
//函数返回：无
//参数说明：无
//功能概要：关闭摄像头
//=====================================================================
void cam_close();

//=====================================================================
//函数名称：cam_FIFO_WRST_1
//函数返回：无
//参数说明：无
//功能概要：FIFO读使能复位口高电平输出
//=====================================================================
void cam_FIFO_WRST_1();

//=====================================================================
//函数名称：cam_FIFO_WRST_0
//函数返回：无
//参数说明：无
//功能概要：FIFO读使能复位口低电平输出
//=====================================================================
void cam_FIFO_WRST_0();

//=====================================================================
//函数名称：cam_FIFO_WR_1
//函数返回：无
//参数说明：无
//功能概要：FIFO写使能口高电平输出
//=====================================================================
void cam_FIFO_WR_1();

//=====================================================================
//函数名称：cam_FIFO_WR_0
//函数返回：无
//参数说明：无
//功能概要：FIFO写使能口低电平输出
//=====================================================================
void cam_FIFO_WR_0();

//=====================================================================
//函数名称：cam_FIFO_RCK_0
//函数返回：无
//参数说明：无
//功能概要：FIFO时钟口低电平输出
//=====================================================================
void cam_FIFO_RCK_0();

//=====================================================================
//函数名称：cam_FIFO_RCK_1
//函数返回：无
//参数说明：无
//功能概要：FIFO时钟口高电平输出
//=====================================================================
void cam_FIFO_RCK_1();

//=====================================================================
//函数名称：cam_FIFO_RRST_0
//函数返回：无
//参数说明：无
//功能概要：FIFO写使能复位低电平输出
//=====================================================================
void cam_FIFO_RRST_0();

//=====================================================================
//函数名称：cam_FIFO_RRST_1
//函数返回：无
//参数说明：无
//功能概要：FIFO写使能复位高电平输出
//=====================================================================
void cam_FIFO_RRST_1();

//=====================================================================
//函数名称：cam_FIFO_OE_0
//函数返回：无
//参数说明：无
//功能概要：FIFO输出使能低电平输出
//=====================================================================
void cam_FIFO_OE_0();

//=====================================================================
//函数名称：cam_FIFO_OE_0
//函数返回：无
//参数说明：无
//功能概要：FIFO输出使能高电平输出
//=====================================================================
void cam_FIFO_OE_1();

#endif 
