//=====================================================================
//文件名称：sccb.h
//功能概要：串行摄像机控制总线协议(SCCB)底层驱动构件头文件
//版    本：2019-11-10 
//使用芯片：STM32L433xx
//=====================================================================
#ifndef _SCCB_H_
#define _SCCB_H_

#include "gec.h"


#define S_CLK    (PTE_NUM|13)   //定义SCCB的时钟脚
#define S_DIO    (PTE_NUM|14)	 //定义SCCB的数据脚

//=====================================================================
//函数名称：sccb_init
//函数返回：无
//参数说明：无
//功能概要：SCCB初始化函数
//=====================================================================
void SCCB_Init();

//=====================================================================
//函数名称：SCCB_Read
//函数返回：无
//参数说明：无
//功能概要：SCCB向指定寄存器读取一个字节数据
//=====================================================================
void SCCB_Read(uint8_t deceAddress, uint8_t regisetrAdd, uint8_t *Data);

//=====================================================================
//函数名称：SCCB_Write
//函数返回：无
//参数说明：无
//功能概要：SCCB向指定寄存器发送一个字节数据
//=====================================================================
void SCCB_Write(uint8_t deceAddress, uint8_t regisetrAdd, uint8_t Data);

#endif 




